 [
    {
        "name": "Luzones",
        "leaderName": "Lakandula",
        "adjective": ["Luzones"],
        "startBias": ["River","Coast"],
        "preferredVictoryType": "Diplomatic",

        "startIntroPart1": ".",
        "startIntroPart2": ".",

        "declaringWar": "Your people have agitated the spirits for too long!",
        "attacked": "With the power of Maycapal, I will smite you!",
        "defeated": "We may have lost this battle, but our spirit cannot be defeated.",
        "introduction": "Welcome to our lands. We are the Luzones, a people of strength and courage. If commerce is what you seek, then you've come to the right place.",

        "neutralHello": "Welcome. We are open to diplomatic relations with all who come in peace.",
        "hateHello": "You have upsetted the spirits. Begone.",
        "tradeRequest": "I have something that may interest you, foreigner, in exchange for...",

        "outerColor": [255,223,200],
        "innerColor": [185,53,36],
        "uniqueName": "Bayanihan",
        "uniques": ["When declaring friendship, both parties gain a [+10]% boost to great person generation","[-50]% tile improvement construction time <within [1] tiles of a [City center]>"],
        "cities": ["Tundun at Maynilad","Namayan","Bitukang Manok","Sunog-Apog","Maysapan","Tagig","Nabotas","Sampalok","Mandaluyong","Binondo","Pasay","Kainta","Puliran","Kumintang","Paila","Yamagtogon","Pandakan","Tangway","Kandawe","Morong","Tayabas","Malatarlak","Katanghalan","Baybay","Omaghikon","Binwangan","Pakil","Meykatmon","Sawangan"],
        
    },
    {
     //I'll probably make this a city-state or not?
        "name": "Caboloan",
        "leaderName": "Princess Urduja",
        "adjective": ["Pangasinense"],
        "startBias": ["Coast"],
        "prefferedVictoryType": "Scientific",

        "startIntroPart1": ".",
        "startIntroPart2": ".",

        "declaringWar": "I regret to inform you that Caboloan can no longer tolerate your presence. We declare war on your civilization.",
        "attacked": "We will not be intimidated by your aggression. Caboloan will fight back with all our might.",
        "defeated": "We have fought bravely, but the time has come for Caboloan to accept defeat. May we learn from this experience and grow stronger in the future.",
        "introduction": "Hail, I am Princess Urduja, leader of Caboloan. May our interactions be respectful and productive.",

        "neutralHello": "Welcome to our lands. I am Princess Urduja, ruler of the Caboloan civilization. May our meeting be fruitful and peaceful.",
        "hateHello": "I have heard of your treachery, and I will not stand for it. You will face the wrath of Tawalisi and its fierce warriors. I am Princess Urduja, and you will remember that name.",
        "tradeRequest": "We believe that a trade agreement would be mutually beneficial for Caboloan and your civilization. Would you be interested in discussing further?",

        "outerColor": [65,105,225],
        "innerColor": [51,255,153],
        "uniqueName": "Pangasinan Trade Network",
        "uniques": ["[+1 Culture, +1 Science] [in all coastal cities]", "[+20]% Production when constructing [Water] units [in all cities]"],
        "cities": ["Tawalisi","Binalatongan","Lingayen","Dagupan","Sual"],
    },
    {
     //The same goes with this.. or not?
        "name": "Ibalon",
        "leaderName": "Baltog",
        "adjective": ["Bikolano"],
        "startBias": ["Coast"],
        "prefferedVictoryType": "Cultural",

        "startIntroPart1": ".",
        "startIntroPart2": ".",

        "declaringWar": "Our people will not back down from a fight. Prepare for battle!",
        "attacked": "We will defend ourselves against any aggression. You will not defeat us!",
        "defeated": "Though we have been defeated, the spirit of the Ibalon people lives on. We will rise again!",
        "introduction": "Magandang araw! I am Bantong, the leader of the Ibalon civilization. Our people are known for our bravery and resilience in the face of adversity. Let us work together to build a prosperous and powerful civilization.",

        "neutralHello": "Maayong adlaw! Greetings, friend. I hope our peoples can coexist peacefully and prosperously.",
        "hateHello": "You are an enemy of the Ibalon people, and we will not hesitate to defend ourselves against your aggression.",
        "tradeRequest": "Would you be interested in a trade agreement between our civilizations? Our goods are of the highest quality.",

        "outerColor": [0,0,128],
        "innerColor": [255,215,0],
        "uniqueName": "Epic of Ibalon",
        "uniques": ["[+1 Culture] from every [Farm]"],
        "cities": ["Ibalon","Rawis","Milaud","Masbate","Danlog","Lupa","Himoragat","Piglalabanan","Daet"],
    },
    {
         "name": "Madya-as",
        "leaderName": "Datu Sumakwel",
        "adjective": ["Visayan"],
        "startBias": ["Coast"],
        "prefferedVictoryType": "Domination",

        "startIntroPart1": ".",
        "startIntroPart2": ".",

        "declaringWar": "Our people will not stand idly by while you threaten our sovereignty. We declare war!",
        "attacked": "We will not cower before your threats. We will fight to defend our homes and our families!",
        "defeated": "Though we have fallen in battle, our spirit remains unbroken. We will rise again to defend our lands and our people.",
        "introduction": "Welcome to our lands. I am Datu Sumakwel, ruler of the Madya-as Confederation. What brings you here?",
        "neutralHello": "Hello. We hope that our paths cross without conflict.",
        "hateHello": "Your actions have earned our enmity. We will not tolerate your presence here.",
        "tradeRequest": "We are open to trade, but only if the terms are fair and just.",

        "outerColor": [205,92,92],
        "innerColor": [0,0,128],
        "uniqueName": "Code of Maragtas",
        "uniques": ["[+1 Production, +1 Food] per [3] population [in all cities]","[+3 Culture] <in cities with a [Courthouse]>"],
        "cities": ["Malandog","Aklan","Irong-rong","Hamtik","Sinugbohan","Halaran","Majanos","Guimbal","Katigbawan","Ogtong","Araut","Sumandig","Alakaygan","Bobog","Bontoc","Sumandig","Dalayawan","Kaputatan","Maayon","Kaguyuman","Panit-an","Dao","Sikma","Mapanag","Tipik","Salapi","Bakan","Bueagaw"],
    },
    {
        "name": "Sugbu",
        "leaderName": "Sri Lumay",
        "adjective": ["Cebuano"],
        "startBias": ["Coast"],
        "prefferedVictoryType": "Cultural",

        "startIntroPart1": ".",
        "startIntroPart2": ".",

        "declaringWar": "Regrettably, the time for peaceful coexistence has passed. Prepare for the inevitable clash!",
        "attacked": "Unprovoked aggression shall not go unanswered. The great civilization of Sugbu, under the wise leadership of Sri Lumay, will stand firm and defend its lands and people against this unwarranted attack.",
        "defeated": "Despite our valiant efforts, we, the people of Sugbu, led by the visionary leader Sri Lumay, acknowledge our defeat with grace and dignity. May our civilization rise again, stronger and wiser, in the face of adversity.",
        "introduction": "Greetings, esteemed leader! We are the proud people of Sugbu, and I am Sri Lumay, the guiding light of our flourishing civilization. As the sun rises on this auspicious meeting, we extend our hand in friendship, eager to embrace the diverse tapestry of cultures that intertwine across these lands.",
        "neutralHello": "Let us maintain a cordial relationship and explore the possibilities of cooperation for mutual prosperity.",
        "hateHello": "Your presence is an affront to our civilization..",
        "tradeRequest": "Esteemed ruler Sri Lumay of Sugbu, we humbly propose a trade that could benefit both our great civilizations. Let us forge a prosperous partnership that shall stand the test of time.",

        "outerColor": [255,140,0],
        "innerColor": [0,0,0],
        "uniqueName": "The Lion City",
        "uniques": ["[+2 Gold] <in cities with a [Market]>","[+15]% Strength <when fighting units from a Civilization with more Cities than you>","Cities are razed [2] times as fast"],
        "cities": ["Singhapala","Mandawili","Sialo","Nahalin","Dumaguete","Baybay","Ogmok"],
    },
    {
        "name": "Butuan",
        "leaderName": "Datu Bwisan",
        "adjective": ["Butuanon"],
        "startBias": ["River","Coast"],
        "prefferedVictoryType": "Scientific",
         "favoredReligion": "Hinduism",

        "startIntroPart1": "As the sun rises over the lands of Butuan, a realm blessed by the bounties of nature and shaped by the wisdom of Datu Bwisan, we emerge from the mists of history. Nestled in the lush islands of the Philippine archipelago, the Butuan civilization flourishes as a center of trade, culture, and maritime prowess. With our skilled seafarers and artisans, we shall carve our mark on the pages of time, fostering prosperity and forging alliances in the name of progress and enlightenment.",
        "startIntroPart2": ".",

        "declaringWar": "With the weight of responsibility upon our shoulders, the resolute Butuan civilization, under the unwavering leadership of Datu Bwisan, can no longer shy away from the crucible of conflict. Prepare for war!",
        "attacked": "The Butuan people shall not falter in the face of aggression. We will stand firm and repel any incursion into our sacred lands, for our determination is as strong as the mightiest of warriors.",
        "defeated": "In humility, we acknowledge our defeat on the battlefield.",
        "introduction": "Hail, fellow leader of the distant lands. The Butuanons, led by Datu Bwisan, extends a hand of amity to those who seek harmony and coexistence. Let diplomacy be the cornerstone of our interactions as we navigate the ever-changing currents of history.",
        "neutralHello": "Greetings to you. The Butuananons extends an open hand and offers friendship to all who seek peaceful coexistence and prosperity.",
        "hateHello": "we will not forget the grievances you have inflicted upon us, and we shall stand firm against your ambitions.",
        "tradeRequest": "Honorable leader of the neighboring realm, may we propose a mutually beneficial trade between our illustrious Butuan civilization and your esteemed kingdom. Let prosperity and harmony be the foundations of our exchange.",

        "outerColor": [220,20,60],
        "innerColor": [255,215,0],
        "uniqueName": "All that Glitters",
        "uniques": ["Gain [50]-[100] [Gold] <during We Love The King Day>","Double quantity of [Gold Ore] produced"],
        "cities": ["Butuan","Kabadbaran","Tubay","Hingoong","Tandag","Limasawa","Surigao","Agusan"],
    },
    {
        "name": "Manguindanao",
	"leaderName": "Kudarat",
	"adjective": ["Manguindanaon"],
        "startBias": ["Coast"],
	"preferredVictoryType": "Diplomatic",
	"favoredReligion": "Islam",

	"startIntroPart1": ".",
	"startIntroPart2": ".",

	"declaringWar": "It is not my wish to conquer your realm by force, but we arrive at a point now where there is no alternative.",
	"attacked": "Here come a bunch of armed men waving around and shouting. Should I let this behaviour be?",
	"defeated": "The road ahead is dark, the surrounding pines are dense like walls, the sky and earth are full dark.",
	"introduction": "Welcome, stranger. Do remember, the name is Kudarat. I hope soon we will be close friends.",

	"neutralHello": "Mapia maudtu.",
	"hateHello": "What now?",
	"tradeRequest": "May this offer interest you, my friend?",

	"outerColor": [251,236,127],
     	"innerColor": [146, 74,  1],
	"uniqueName": "Helper of the Faith",
	"uniqueText": "Militaristic City-States grant units 2 times as fast when at war with a common nation \n+33% [Production] when constructing Defensive buildings in all cities",
	"uniques": ["Militaristic City-States grant units [2] times as fast when you are at war with a common nation", 
		    "[+33]% Production when constructing [Walls] buildings [in all cities]", 
		    "[+33]% Production when constructing [Castle] buildings [in all cities]", 
	            "[+33]% Production when constructing [Arsenal] buildings [in all cities]"],
	"cities": ["Kuta Watu","Tamontaka","Dinaig","Tumbao","Pollok","Padang-Padang","Talavan","Tinungkul","Buayan","Kitakubong","Buluan","Tukuran","Inuk","Kalamansig","Pula","Glan","Pinagurusan","Kuruan","Bolong"],
	"spyNames": ["Sajid","Ampatuan","Datumanong","Mariam","Baraguir","Ameni","Murad","Gumbay","Pendatun","Sinsuat"]
    },
    {
        "name": "Lanao",
        "leaderName": "Sultan Batara Shah Tengah",
        "adjective": ["Maranao"],
        "startBias": ["Lakes"],
        "prefferedVictoryType": "Cultural",

        "startIntroPart1": ".",
        "startIntroPart2": ".",

        "declaringWar": "Your actions have left us no choice but to take up arms and defend our honor. We declare war upon you, with determination to safeguard our people and way of life. Let the War begin!",
        "attacked": "The Maranao people stands resolute in the face of aggression. We will defend our lands and people with utmost determination, and those who challenge us shall face the consequences of their actions.",
        "defeated": "With humility and honor, the Maranao people acknowledges our defeat in this conflict. We shall learn from this experience and strive to build a brighter future, free from the burdens of war.",
        "introduction": "Welcome, distinguished leaders, to the realm of the Lanao Confederation. Under the benevolent guidance of Sultan Batara Shah Tengah, our civilization thrives in harmony with nature, culture, and spirituality. Let us forge new alliances and pave the way for a prosperous future together.",
        "neutralHello": "Greetings to you.",
        "hateHello": "Your treacherous ways shall find no quarter in our eyes, and your name shall be inscribed in the annals of infamy.",
        "tradeRequest": "Lanao seeks to strengthen bonds through mutual prosperity. We propose a trade agreement that will benefit both our civilizations.",

        "outerColor": [70,130,180],
        "innerColor": [240,230,140],
        "uniqueName": "People of the Lakes",
        "uniques": ["[+1 Culture, +2 Production] [in all cities] <within [3] tiles of a [Lake]>"],
        "cities": ["Bayabao","Masiu","Unayan","Baloi"],
    },
    {
        "name": "Sulu",
        "leaderName": "Jamalul Kiram",
        "adjective": ["Dayak Kadazan"],
        "startBias": ["Coast"],
        "preferredVictoryType": "Domination",
        "favoredReligion": "Islam",

        "startIntroPart1": ".",
        "startIntroPart2": "Oh clever and virtuous Jamalul Kiram, will you rebuild Sulu and lead your people to even greater heights of glory? Will you take up the challenge and vanquish your foes under heaven's watchful eyes? Can you build a civilization that will stand the test of time?",

        "declaringWar": "Your transgressions are as deep as oceans. Prepare for war!",
        "attacked": "I will not allow you to remain in power any longer. You have offended me for too long!",
        "defeated": "With God's help, may Sulu people one day reclaim its territory.",
        "introduction": "I am Jamulul Kiram, Sultan of Sulu. It is my great pleasure to finally meet you.",

        "neutralHello": "Good day.",
        "hateHello": "Oh, it's you.",
        "tradeRequest": "Better hurry, I may change my mind.",

        "outerColor": [52, 14, 32],
        "innerColor": [225,225,225],
        "uniqueName": "Moro Raids",
        "uniqueText": "Free Worker appears upon constructing Courthouse\nMay sell Worker for 35 [Gold]",
        "uniques": ["Free [Worker] appears <upon constructing [Courthouse]>","[Worker] units gain the [Slave] promotion"],
        "cities": ["Buana","Maimbung","Palawan","Moroland","Sandakan","Kudat","Lahad Datu","Tawau","Semporna",
            "Tawi-tawi","Jolo","Basilan","Zamboanga","Indanan","Pangutaran","Parang","Patikul","Talipao","Mactan"],
        "spyNames": ["Hashim","Alauddin","Muiz","Nasiruddin","Bakhtiar","Rashid","Muwallil","Azam","A'lam","Halim"]
	//city-states: Macabebe, Leyte, Samtoy, Ma-i, Dapitan or Bo-ol, Taytay, Sandao, Kankabatok, Mangktan, Idjang?
    }
 ]
